import requests
from bs4 import BeautifulSoup
from selenium import webdriver
import time
import json
import csv

max_province=40
max_city=100
max_page=1000


cook='mallcity=11|110; route=455b06fdcc99c51409b42294c58c5ecc; e3=LfypbKRTQ0tX6GfbZqyyhkxq9JG1Py26J8LmMkL29TYGTxT6zTGd!-1703149837; userprocode=011; WT_FPC=id=2d49c99eb46974e87e41527386615777:lv=1527386615781:ss=1527386615777'
headers = {
    "Cookie":cook,
    'Accept': 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8',
    'Accept - Encoding':'gzip, deflate',
    'Accept-Language':'zh-CN,zh;q=0.9',
    'Connection':'keep-alive',
    'User-Agent': 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/64.0.3282.186 Safari/537.36',}
citys= [[["110","北京市"]],
 			  [["130","天津市"]],
 			  [["188","石家庄市"],["181","唐山市"],["182","秦皇岛市"],["186","邯郸市"],
 			   ["185","邢台市"], ["187","保定市"], ["184","张家口市"],["189","承德市"],
 			   ["183","廊坊市"], ["180","沧州市"],["720","衡水市"]],
 			  [["190","太原市"],["193","大同市"],["192","阳泉市"],["199","朔州市"],
 			   ["198","忻州市"],["191","晋中市"],["200","吕梁市"],["195","长治市"],
 			   ["194","晋城市"],["197","临汾市"],["196","运城"]],
 			  [["101","呼和浩特市"],["102","包头市"],["106","乌海市"],["107","赤峰市"],
 			   ["108","呼伦贝尔市"],["113","兴安盟"],["109","通辽市"],["111","锡林郭勒盟"],
 			   ["103","乌兰察布市"],["104","鄂尔多斯市"],["105","巴彦淖尔市"],["114","阿拉善盟"]],
 			  [["910","沈阳市"],["940","大连市"],["912","鞍山市"],["913","抚顺市"],
 			   ["914","本溪市"],["915","丹东市"],["916","锦州市"],["917","营口市"],
 			   ["918","阜新市"],["919","辽阳市"],["911","铁岭市"],["920","朝阳市"],
 			   ["921","盘锦市"],["922","葫芦岛市"]],
 			  [["901","长春市"],["902","吉林市"],["909","延边朝鲜族自治州"],["903","四平市"],
 			   ["905","通化市"],["907","白城市"],["906","辽源市"],["904","松原市"],["908","白山市"]],
 			  [["971","哈尔滨市"],["973","齐齐哈尔市"],["988","牡丹江市"],["976","佳木斯市"],
 			   ["989","绥化市"],["981","大庆市"],["991","鸡西市"],["990","黑河市"],
 			   ["996","伊春市"],["994","双鸭山市"],["993","鹤岗市"],["992","七台河市"],["995","大兴安岭地区"]],
 			  [["310","上海"]],
 			  [["340","南京市"],["450","苏州市"],["330","无锡市"],["440","常州市"],
 			   ["430","扬州市"],["343","镇江市"],["358","南通市"],["350","徐州市"],
 			   ["445","泰州市"],["348","盐城市"],["354","淮安市"],["346","连云港"],["349","宿迁市"]],
 			  [["360","杭州市"],["470","温州市"],["468","衢州市"],["362","湖州市"],
 			   ["363","嘉兴市"],["365","绍兴市"],["476","台州市"],["469","丽水市"],
 			   ["367","金华市"],["364","舟山市"],["370","宁波市"]],
 			  [["302","安庆市"],["301","蚌埠市"],["318","亳州市"],["309","巢湖市"],
 			   ["317","池州市"],["312","滁州市"],["306","阜阳市"],["305","合肥市"],
 			   ["314","淮北市"],["307","淮南市"],["316","黄山市"],["304","六安市"],
 			   ["300","马鞍山市"],["313","宿州市"],["308","铜陵市"],["303","芜湖市"],["311","宣城市"]],
 			  [["380","福州市"],["390","厦门市"],["480","泉州市"],["395","漳州市"],
 			   ["386","宁德市"],["385","莆田市"],["387","南平市"],["389","三明市"],["384","龙岩市"]],
 			  [["750","南昌"],["755","九江"],["757","上饶"],["756","宜春"],
 			   ["752","赣州"],["759","抚州"],["753","新余"],["751","吉安"],
 			   ["740","景德镇"],["754","鹰潭"],["758","萍乡"]],
 			  [["170","济南市"],["166","青岛市"],["150","淄博市"],["157","枣庄市"],
 			   ["156","东营市"],["161","烟台市"],["155","潍坊市"],["158","济宁市"],
 			   ["172","泰安市"],["152","威海市"],["154","日照市"],["160","莱芜市"],
 			   ["153","临沂市"],["173","德州市"],["174","聊城市"],["151","滨州市"],["159","菏泽市"]],
 			  [["760","郑州市"],["761","洛阳市"],["762","开封市"],["764","新乡市"],
 			   ["765","许昌市"],["766","漯河市"],["767","安阳市"],["768","商丘市"],
 			   ["770","周口市"],["771","驻马店市"],["774","鹤壁市"],["776","信阳市"],["777","南阳市"],
 			   ["772","三门峡市"],["773","濮阳市"],["763","焦作市"],["769","平顶山市"],["775","济源市"]],
 			  [["710","武汉"],["711","宜昌"],["712","荆州"],["714","黄冈"],
 			   ["715","黄石"],["716","襄阳"],["717","孝感"],["718","鄂州"],
 			   ["719","咸宁"],["721","十堰"],["723","随州"],["724","荆门"],
 			   ["727","恩施"],["713","仙桃"],["726","潜江"],["725","天门"],["722","神农架"]],
 			  [["741","长沙市"],["742","株洲市"],["743","湘潭市"],["744","衡阳市"],
 			   ["745","岳阳市"],["747","益阳市"],["748","郴州市"],["749","常德市"],["791","娄底市"],
 			   ["792","邵阳市"],["794","张家界市"],["795","怀化市"],["796","永州市"],["793","湘西自治州"]],
 			  [["510","广州市"],["540","深圳市"],["620","珠海市"],["560","汕头市"],
 			   ["558","韶关市"],["670","河源市"],["528","梅州市"],["570","惠州市"],
 			   ["525","汕尾市"],["580","东莞市"],["556","中山市"],["550","江门市"],
 			   ["530","佛山市"],["565","阳江市"],["520","湛江市"],["568","茂名市"],
 			   ["536","肇庆市"],["535","清远市"],["531","潮州市"],["526","揭阳市"],["538","云浮市"]],
 			  [["591","南宁市"],["593","柳州市"],["592","桂林市"],["594","梧州市"],
 			   ["595","玉林市"],["596","百色市"],["597","钦州市"],["598","河池市"],["599","北海市"],
 			   ["590","防城港市"],["589","贵港市"],["588","贺州市"],["600","崇左市"],["601","来宾市"]],
 			  [["501","海口"],["502","三亚"],["504","琼海市"],["503","儋州市"],
 			   ["505","文昌市"],["506","东方市"],["507","五指山市"],["508","万宁市"],
 			   ["509","定安县"],["519","屯昌县"],["511","澄迈县"],["512","临高县"],["513","陵水县"],
 			   ["514","琼中县"],["515","保亭县"],["516","乐东县"],["517","昌江县"],["518","白沙县"]],
 			  [["831","重庆市"]],
 			  [["810","成都市"],["813","攀枝花市"],["815","泸州市"],["825","德阳市"],
 			   ["824","绵阳市"],["826","广元市"],["821","遂宁市"],["816","内江市"],
 			   ["814","乐山市"],["822","南充市"],["817","宜宾市"],["823","广安市"],
 			   ["820","达州市"],["827","巴中市"],["811","雅安市"],["819","眉山市"],["830","资阳市"],
 			   ["818","自贡市"],["829","阿坝藏族羌族自治州"],["812","凉山彝族自治州"],["828","甘孜藏族自治州"]],
 			  [["850","贵阳"],["787","遵义市"],["851","毕节市"],["853","六盘水"],
 			   ["788","黔南州"],["786","黔东南州"],["789","安顺市"],["852","黔西南州"],["785","铜仁地区"]],
 			  [["862","大理白族自治州"],["861","红河哈尼族彝族自治州"],["860","昆明市"],["863","丽江市"],
 			   ["866","曲靖市"],["736","西双版纳傣族自治州"],["865","玉溪市"],["864","楚雄彝族自治州"],
 			   ["867","昭通市"],["869","普洱市"],["731","保山市"],["732","文山壮族苗族自治州"],
 			   ["733","临沧市"],["730","德宏傣族景颇族自治州"],["735","迪庆藏族自治州"],["734","怒江傈僳族自治州"]],
 			  [["790","拉萨"],["797","日喀则"],["798","山南"],["799","林芝"],
 			   ["801","那曲"],["800","昌都"],["802","阿里"]],
 			  [["841","西安市"],["844","咸阳市"],["843","渭南市"],["840","宝鸡市"],
 			   ["849","汉中市"],["842","延安市"],["845","榆林市"],["846","铜川市"],
 			   ["848","安康市"],["847","商洛市"]],
 			  [["870","兰州市"],["876","嘉峪关市"],["931","酒泉市"],["879","白银市"],
 			   ["873","庆阳市"],["877","天水市"],["872","平凉市"],["871","定西市"],["878","临夏回族自治州"],
 			   ["960","陇南市"],["961","甘南藏族自治州"],["875","张掖市"],["874","武威市"],["930","金昌市"]],
 			  [["700","西宁市"],["701","海东地区"],["707","黄南藏族自治州"],["702","格尔木市"],["704","海西蒙古族藏族自治州"],
 			   ["706","海北藏族自治州"],["705","海南藏族自治州"],["709","玉树藏族自治州"],["708","果洛藏族自治州"]],
 			  [["880","银川市"],["883","吴忠市"],["884","石嘴山市"],["886","中卫市"],["885","固原市"]],
 			  [["890","乌鲁木齐市"],["891","昌吉回族自治州"],["953","阿勒泰地区"],["897","喀什地区"],
 			   ["893","石河子市"],["898","伊犁哈萨克自治州"],["899","克拉玛依市"],["895","巴音郭楞蒙古自治州"],
 			   ["896","阿克苏地区"],["900","哈密地区"],["894","吐鲁番地区"],["892","奎屯市"],
 			   ["951","博尔塔拉蒙古自治州"],["952","塔城地区"],["955","和田地区"],["954","克孜勒苏柯尔克孜自治州"]]
 			];			
 			
def postgetJson(city):
    url='http://iservice.10010.com/e3/static/life/listHallByPropertyNew?_=1527392283196'
    citycode=int(city[0])
    page=1
    while True:
        r = requests.post(url, data = {'cityCode':citycode,'page':page})
        try:
            data=json.loads(r.text)["BusinessHallList"]  
        except:
            print(city[1]+'营业厅抓取第'+str(page)+"页不存在，总页码为"+str(page-1))        
            break
        for i in range(len(data)):
            row=[city[1],data[i]['epName'],data[i]['epAddress']]
            csv_write.writerow(row)
        time.sleep(1)
        page+=1

f=open('unicomService.csv','w+',encoding='gb18030',newline='')
csv_write=csv.writer(f)
for m in range(len(citys)):
    for n in range(len(citys[m])):
        city=citys[m][n]
        postgetJson(city)
